{
  "scroll_text.default": "Welcome to Messenger! Stay connected with your friends and family. You can customize the scrolling text via the scroll-text.txt file.",
  "app.title": "Messenger",
  "chat.title": "Chat",
  "chat.send": "Send",
  "chat.placeholder": "Type a message...",
  "notification.push_url_placeholder": "Enter push notification URL",
  "notification.save_button": "Save",
  "chat.quote_from": "Quoted from {safeTimestamp}",
  "chat.quote_reply": "Reply with quote",
  "status.loading_messages": "Loading messages (page {page})...",
  "status.loaded_messages": "Loaded {count} messages ({currentPage}/{totalPages})",
  "status.failed_load_history": "Failed to load history",
  "loading_indicator.text": "Loading messages...",
  "audio_player.not_supported": "Your browser does not support audio playback.",
  "video_player.not_supported": "Your browser does not support video playback.",
  "file.download_title": "Download file: {fileName}",
  "notification.settings_title": "Notification Settings",
  "sticker.modal_title": "Sticker Selection",
  "version.info": "v6.1.0 | 25 Aug 2025",
  "version.update_title": "Version Update",
  "version.update_content": "We're thrilled to announce the addition of dark mode to enhance your messaging experience! You can now enjoy chatting comfortably in low-light settings with our brand-new dark mode feature.\n\nDark mode has been meticulously crafted with a dedicated stylesheet, dark.css, which offers improved contrast and readability throughout the app. Whether you're messaging late at night or simply prefer a darker interface, this update ensures you won't strain your eyes while staying in touch with friends and family.\n\nOur development team has optimised the colours of all major UI elements to create a cohesive and visually appealing dark theme. Scrollbars are now easier to see and use, and modals stand out clearly against the dark background. Input fields have been adjusted for better visibility, so you can type your messages without any trouble.\n\nMessages themselves have also had special attention. The text colours and background combinations have been fine-tuned to ensure your conversations are always easy to read. That means no more squinting or adjusting your screen brightness when you're in a dimly lit room.\n\nTo switch to dark mode, simply go to the app's settings and look for the dark mode option. We believe this new feature will make your time on Messenger even more enjoyable, regardless of the lighting conditions. Give it a go and let us know what you think!",
  "version.got_it": "Got It!",
  "image_action.choose": "Choose Action",
  "image_action.view": "View",
  "image_action.edit": "Edit",
  "image_action.cancel": "Cancel",
  "image_editor.close": "Close",
  "image_editor.save_send": "Save and Send",
  "image_editor.edit_image": "Edit Image"
}