{  "scroll_text.default": "Welcome to Messenger! Stay connected with your friends and family. You can customize the scrolling text through the scroll-text.txt file.",
  "chat.undo_message": "Withdraw message",
  "chat.message_undone": "This message has been withdrawn.",
  "chat.confirm_undo": "Are you sure you want to withdraw this message?",
  "chat.undo_failed": "Failed to withdraw message: {errorMessage}",
  "chat.message_undone_success": "Message has been withdrawn successfully",
  "chat.offline": "You are offline, cannot withdraw message",
  "app.title": "Messenger",
  "chat.title": "Chat",
  "chat.send": "Send",
  "chat.placeholder": "Message...",
  "notification.push_url_placeholder": "Enter push notification URL",
  "notification.save_button": "Save",
  "chat.quote_from": "Quoted from {safeTimestamp}",
  "chat.quote_reply": "Reply with quote",
  "status.loading_messages": "Loading messages (page {page})...",
  "status.loaded_messages": "Loaded {count} messages ({currentPage}/{totalPages})",
  "status.failed_load_history": "Failed to load history",
  "loading_indicator.text": "Loading messages...",
  "audio_player.not_supported": "Your browser does not support audio playback.",
  "video_player.not_supported": "Your browser does not support video playback.",
  "file.download_title": "Download file: {fileName}",
  "notification.settings_title": "Notification Settings",
  "sticker.modal_title": "Sticker Selection",
  "version.info": "v7.0.0 | Aug 27, 2025",
  "version.update_title": "Version Update",
  "version.update_content": "Message Recall Feature: Infusing Digital Communication with Humanistic Tolerance and Precise Control\n\nIn an era where digital communication happens at the speed of light, a single swipe, accidental tap, or hasty decision can instantly send out an erroneous, hasty, or incomplete message. This can lead to misunderstandings, embarrassment, or even more serious consequences. We understand that perfect communication is an ideal, not the norm. Therefore, we're excited to introduce the \"Message Recall\" feature. This isn't just a simple technological upgrade; it's a profound practice of humanistic care, aiming to inject a crucial sense of security, control, and composure into users' digital interactions. Its core value goes far beyond the act of \"undoing\" – it's about trust, professionalism, and peace of mind.\n\nFirst and foremost, the most direct value of this feature lies in **error correction and restoration, safeguarding personal professional image**. In the fast-paced modern workplace, we often juggle multiple conversations simultaneously. Mistakenly sending a message meant for colleague A to the entire company group, typing the wrong key data or project date in a rush, or sending an unconfirmed file version – these seemingly minor mistakes can disproportionately damage personal credibility and project progress in a professional context. Traditional remedies involve sending a series of corrective messages like \"Sorry, the previous message was incorrect...\", \"Please refer to this one...\", or \"Note: Wrong message sent...\". Not only are these methods ineffective, but they also amplify the error, clutter the conversation flow, and further highlight the sender's oversight. The Message Recall feature elegantly addresses this pain point. It provides a brief yet crucial \"golden two-minute\" window, allowing users to quickly and silently retract their mistakes as if they never happened, thus maintaining the rigor of communication and personal professional image flawlessly. Users no longer need to pay the unnecessary cost of explanations for a simple accidental tap.\n\nSecondly, this feature significantly **reduces the anxiety of digital communication and enhances confidence and composure in interactions**. Many users have experienced the anxious moments of \"Post-Send Regret\": perhaps realizing that the wording was too blunt and likely to cause misunderstandings, sending irrational remarks in a fit of anger and regretting it later, or suddenly noticing that the auto-correct turned a sincere message into nonsense. This anxiety can strike the moment the message is sent, becoming a heavy psychological burden. The Message Recall feature is like a digital \"safety net\" for every user. It doesn't encourage careless communication; instead, its very existence brings deep psychological comfort. Knowing that there's a chance to correct mistakes gives users a sense of security, which translates into a more confident and relaxed communication mindset. They can focus more on the content of their expression rather than living in fear of \"never making a mistake\". The release of this psychological pressure is a significant hidden value of this feature.\n\nThirdly, the feature **optimizes the clarity and effectiveness of conversations**. As mentioned earlier, using a series of new messages to correct old mistakes can severely clutter the conversation timeline, confusing other participants and requiring them to spend extra effort to discern which information is valid. This is a major distraction for important decision-making discussions or information-dense project communications. The Recall feature fundamentally prevents conversation fragmentation by removing the source of errors, ensuring a clean, accurate, and efficient information flow. All participants see a tidier and more accurate conversation history, which directly improves the efficiency of team collaboration and information transmission.\n\nLast but not least, the design of this feature reflects **respect and transparency towards all participants in the communication**. We didn't choose to make messages \"disappear silently\", which would arouse suspicion and mistrust. Instead, when a message is recalled, the system leaves a clear prompt in the conversation: \"You recalled a message\" or \"[User] recalled a message\". This notification is crucial as it maintains the integrity of the conversation context and remains transparent to all participants. It balances the sender's right to correct mistakes and the receiver's right to know about changes in the conversation history. The philosophy behind this design advocates for healthy, transparent digital relationships built on honesty rather than concealment. It tells everyone that there was a corrected mistake here, but there's no need to dwell on it.\n\nIn conclusion, the core value of the Message Recall feature is that it puts \"people\" back at the center of technology. It acknowledges that humans are inherently imperfect, and the purpose of technology should be to compensate for this imperfection rather than magnify it. It offers more than just a two-minute window; it's a precious gift: a space to make mistakes, an opportunity to correct them in a timely manner, and a rare sense of composure and peace in the digital world. By empowering users with this precise control, we're not only building more powerful software but also cultivating a healthier, more confident, and more efficient communication culture. This small step marks a solid stride towards a more considerate and humanized future for our product.",
  "version.got_it": "Got It!",
  "image_action.choose": "Choose Action",
  "image_action.view": "View",
  "image_action.edit": "Edit",
  "image_action.cancel": "Cancel",
  "image_editor.close": "Close",
  "image_editor.save_send": "Save and Send",
  "image_editor.edit_image": "Edit Image",
  "audio_upload.select_file": "Select Audio File",
  "audio_upload.browser_not_supported": "Your browser does not support direct recording. Click below to select an audio file.",
  "scroll_text.load_failed": "Failed to load scroll text",
  "error.image_preview_failed": "Failed to preview image, please try again.",
  "error.image_editor_load_failed": "Failed to load image editor, please refresh the page and try again.",
  "error.image_editor_open_failed": "Failed to open image editor: {errorMessage}",
  "error.save_image_failed": "Failed to save image: {errorMessage}",
  "error.send_image_failed": "Failed to send image, please try again.",
  "error.audio_upload_option_failed": "Unable to show upload options, please select a file manually.",
  "socket.connected": "Connected",
  "socket.disconnected": "Disconnected",
  "socket.connection_error": "Connection error: {errorMessage}",
  "message.send_error": "Send message error: {errorMessage}",
  "push_url.save_error": "Save push url error: {errorMessage}",
  "push_url.empty_url": "Not input push url",
  "push_url.remove_error": "Remove push url error: {errorMessage}",
  "pull_to_load.more": "↑ Get more",
  "file_upload.progress": "Uploading file: {percent}%",
  "file_upload.uploaded": "File uploaded successfully",
  "upload.no_file_url": "Upload failed: Server did not return file URL",
  "file_upload.button_title": "Upload file",
  "upload.server_response_format_error": "Upload failed: Server response format error",
  "upload.failed": "Upload failed: {statusText}",
  "upload.network_error": "Network error, upload failed",
  "sticker.load_failed": "Failed to load stickers",
  "recording.in_progress": "Recording... Click or release to end",
  "recording.microphone_permission_failed": "Failed to get microphone permission, please check browser settings",
  "recording.too_short": "Recording time is too short, please try again",
  "audio_upload.progress": "Uploading voice message: {percent}%",
  "audio_upload.sent": "Voice message sent ({duration}s)",
  "chat.sticker": "Send Sticker",
  "chat.upload": "Upload File",
  "chat.record_audio": "Record Voice Message"
}