{
  "scroll_text.default": "Welcome to Messenger! Stay connected with your friends and family. You can customize the scrolling text through the scroll-text.txt file.",
  "app.title": "Messenger",
  "chat.title": "Chat",
  "chat.send": "Send",
  "chat.placeholder": "Message...",
  "notification.push_url_placeholder": "Enter push notification URL",
  "notification.save_button": "Save",
  "chat.quote_from": "Quoted from {safeTimestamp}",
  "chat.quote_reply": "Reply with quote",
  "status.loading_messages": "Loading messages (page {page})...",
  "status.loaded_messages": "Loaded {count} messages ({currentPage}/{totalPages})",
  "status.failed_load_history": "Failed to load history",
  "loading_indicator.text": "Loading messages...",
  "audio_player.not_supported": "Your browser does not support audio playback.",
  "video_player.not_supported": "Your browser does not support video playback.",
  "file.download_title": "Download file: {fileName}",
  "notification.settings_title": "Notification Settings",
  "sticker.modal_title": "Sticker Selection",
  "version.info": "v6.1.0 | Aug 25, 2025",
  "version.update_title": "Version Update",
  "version.update_content": "We're excited to announce the addition of dark mode to enhance your messaging experience! Now, you can enjoy chatting comfortably in low-light environments with our brand-new dark mode feature.\n\nDark mode has been carefully designed with a dedicated stylesheet, dark.css, that brings improved contrast and readability to every part of the app. Whether you're sending messages late at night or just prefer a darker interface, this update ensures your eyes won't strain as you stay connected with friends and family.\n\nOur development team has optimized the colors of all major UI elements to create a cohesive and visually appealing dark theme. Scrollbars are now easier to see and use, while modals stand out clearly against the dark backdrop. Input fields have been adjusted for better visibility, so you can type your messages without any hassle.\n\nMessages themselves have also received special attention. The text colors and background combinations have been fine-tuned to make sure your conversations are always easy to read. This means no more squinting or adjusting your screen brightness when you're in a dimly lit room.\n\nTo switch to dark mode, simply navigate to the app's settings and look for the dark mode option. We believe this new feature will make your time on Messenger even more enjoyable, no matter the lighting conditions. Give it a try and let us know what you think!",
  "version.got_it": "Got It!",
  "image_action.choose": "Choose Action",
  "image_action.view": "View",
  "image_action.edit": "Edit",
  "image_action.cancel": "Cancel",
  "image_editor.close": "Close",
  "image_editor.save_send": "Save and Send",
  "image_editor.edit_image": "Edit Image",
  "audio_upload.select_file": "Select Audio File",
  "scroll_text.load_failed": "Failed to load scroll text"
}