{
  "scroll_text.default": "¡Bienvenido a Messenger! Mantente conectado con tus amigos y familiares. Puedes personalizar el texto de desplazamiento a través del archivo scroll-text.txt.",
  "app.title": "Mensajero",
  "chat.title": "Chat",
  "chat.send": "Enviar",
  "chat.placeholder": "Escribe un mensaje...",
  "notification.push_url_placeholder": "Introduce la URL de notificación push",
  "notification.save_button": "Guardar",
  "chat.quote_from": "Cita de {safeTimestamp}",
  "chat.quote_reply": "Responder con cita",
  "status.loading_messages": "Cargando mensajes (página {page})...",
  "status.loaded_messages": "Cargados {count} mensajes ({currentPage}/{totalPages})",
  "status.failed_load_history": "No se pudo cargar el historial",
  "loading_indicator.text": "Cargando mensajes...",
  "audio_player.not_supported": "Su navegador no admite la reproducción de audio.",
  "video_player.not_supported": "Su navegador no admite la reproducción de vídeo.",
  "file.download_title": "Descargar archivo: {fileName}",
  "notification.settings_title": "Configuración de notificaciones",
  "sticker.modal_title": "Selección de stickers",
  "version.info": "v6.0.0 | 25 de agosto de 2025",
  "version.update_title": "Actualización de Versión",
  "version.update_content": "Esta actualización ha optimizado por completo el rendimiento del sistema y la interacción de la interfaz, mejorando aún más su experiencia de uso. Hemos realizado ajustes detallados en varios flujos de operación, que responden más rápido y brindan retroalimentación más natural, con la esperanza de que cada clic sea fluido y cómodo.\nAdemás, la nueva versión amplía el soporte para la carga y vista previa de varios formatos de archivo. Ya sea documentos, imágenes o archivos comprimidos, ahora puede ver y administrar los archivos en línea de manera más conveniente, olvidándose por completo de los problemas de compatibilidad de formatos.\nComo siempre, nos preocupamos por mejorar cada detalle, con el objetivo de brindarle una herramienta más práctica y confiable. Agradecemos su apoyo constante y seguiremos esforzándonos para ofrecerle más funciones útiles.",
  "version.got_it": "¡Entendido!"
}