{
  "scroll_text.default": "¡Bienvenido a Messenger! Mantente conectado con tus amigos y familiares. Puedes personalizar el texto de desplazamiento a través del archivo scroll-text.txt.",
  "app.title": "Mensajero",
  "chat.title": "Chat",
  "chat.send": "Enviar",
  "chat.placeholder": "Escribe un mensaje...",
  "notification.push_url_placeholder": "Introduce la URL de notificación push",
  "notification.save_button": "Guardar",
  "chat.quote_from": "Cita de {safeTimestamp}",
  "chat.quote_reply": "Responder con cita",
  "status.loading_messages": "Cargando mensajes (página {page})...",
  "status.loaded_messages": "Cargados {count} mensajes ({currentPage}/{totalPages})",
  "status.failed_load_history": "No se pudo cargar el historial",
  "loading_indicator.text": "Cargando mensajes...",
  "audio_player.not_supported": "Su navegador no admite la reproducción de audio.",
  "video_player.not_supported": "Su navegador no admite la reproducción de vídeo.",
  "file.download_title": "Descargar archivo: {fileName}",
  "notification.settings_title": "Configuración de notificaciones",
  "sticker.modal_title": "Selección de stickers",
  "version.info": "v6.1.0 | 25 de agosto de 2025",
  "version.update_title": "Actualización de Versión",
  "version.update_content": "Estamos encantados de anunciar la incorporación del modo oscuro para mejorar tu experiencia de mensajería. Ahora puedes disfrutar de chatear cómodamente en entornos de poca luz con nuestra nueva función de modo oscuro.\n\nEl modo oscuro ha sido diseñado cuidadosamente con una hoja de estilos dedicada, dark.css, que ofrece un mejor contraste y legibilidad en todas las partes de la aplicación. Ya sea que estés enviando mensajes tarde en la noche o simplemente prefieras una interfaz más oscura, esta actualización garantiza que tus ojos no se cansarán mientras te mantienes conectado con amigos y familiares.\n\nNuestro equipo de desarrollo ha optimizado los colores de todos los elementos principales de la interfaz de usuario para crear un tema oscuro cohesivo y visualmente atractivo. Las barras de desplazamiento son ahora más fáciles de ver y usar, mientras que los cuadros modales destacan claramente sobre el fondo oscuro. Los campos de entrada se han ajustado para una mejor visibilidad, así que puedes escribir tus mensajes sin problemas.\n\nLos propios mensajes también han recibido una atención especial. Los colores del texto y las combinaciones de fondos se han afinado para asegurarse de que tus conversaciones siempre sean fáciles de leer. Esto significa que ya no tendrás que entornar los ojos ni ajustar el brillo de la pantalla cuando estés en una habitación poco iluminada.\n\nPara cambiar al modo oscuro, simplemente ve a la configuración de la aplicación y busca la opción de modo oscuro. Creemos que esta nueva función hará que tu tiempo en Messenger sea aún más placentero, independientemente de las condiciones de iluminación. ¡Dale una oportunidad y háznos saber qué te parece!",
  "version.got_it": "¡Entendido!",
  "image_action.choose": "Elegir Acción",
  "image_action.view": "Ver",
  "image_action.edit": "Editar",
  "image_action.cancel": "Cancelar",
  "image_editor.close": "Cerrar",
  "image_editor.save_send": "Guardar y Enviar",
  "image_editor.edit_image": "Editar Imagen",
  "audio_upload.select_file": "Seleccionar Audio",
  "audio_upload.browser_not_supported": "Su navegador no admite la captura de audio. Por favor, seleccione un archivo de audio desde su computadora.",
  "scroll_text.load_failed": "Error al cargar el texto de desplazamiento",
  "error.image_preview_failed": "Error al cargar la previsualización de la imagen. Por favor, inténtelo de nuevo.",
  "error.image_editor_load_failed": "Error al cargar el editor de imagen. Por favor, inténtelo de nuevo.",
  "error.image_editor_open_failed": "Error al abrir el editor de imagen: {errorMessage}",
  "error.save_image_failed": "Error al guardar la imagen: {errorMessage}",
  "error.send_image_failed": "Error al enviar la imagen. Por favor, inténtelo de nuevo.",
  "error.audio_upload_option_failed": "Error al mostrar las opciones de carga de audio. Por favor, inténtelo de nuevo."
}