{
  "scroll_text.default": "Bienvenue sur Messenger ! Restez connecté avec vos amis et votre famille. Vous pouvez personnaliser le texte défilant via le fichier scroll-text.txt.",
  "app.title": "Messagerie",
  "chat.title": "Discussion",
  "chat.send": "Envoyer",
  "chat.placeholder": "Écrivez un message...",
  "notification.push_url_placeholder": "Entrez l'URL de notification push",
  "notification.save_button": "Enregistrer",
  "chat.quote_from": "Citation de {safeTimestamp}",
  "chat.quote_reply": "Répondre avec citation",
  "status.loading_messages": "Chargement des messages (page {page})...",
  "status.loaded_messages": "{count} messages chargés ({currentPage}/{totalPages})",
  "status.failed_load_history": "Échec du chargement de l'historique",
  "loading_indicator.text": "Chargement des messages...",
  "audio_player.not_supported": "Votre navigateur ne prend pas en charge la lecture audio.",
  "video_player.not_supported": "Votre navigateur ne prend pas en charge la lecture vidéo.",
  "file.download_title": "Télécharger le fichier : {fileName}",
  "notification.settings_title": "Paramètres des notifications",
  "sticker.modal_title": "Sélection de stickers",
  "version.info": "v6.0.0 | 25 août 2025",
  "version.update_title": "Mise à jour de la version",
  "version.update_content": "Cette mise à jour a entièrement optimisé les performances du système et l'interaction avec l'interface, améliorant encore votre expérience d'utilisation. Nous avons effectué des ajustements détaillés sur de nombreux flux d'opérations, offrant des réponses plus rapides et plus naturelles. Nous espérons que chaque clic sera fluide et agréable.\nEn outre, la nouvelle version étend la prise en charge du téléchargement et de l'aperçu de nombreux formats de fichiers. Que ce soit des documents, des images ou des archives, vous pouvez désormais consulter et gérer vos fichiers en ligne plus facilement, sans vous soucier des problèmes de compatibilité de format.\nComme toujours, nous nous attardons sur chaque détail pour vous offrir un outil plus pratique et plus fiable. Merci pour votre soutien constant. Nous continuerons d'efforcer pour apporter encore plus de fonctionnalités utiles !",
  "version.got_it": "Compris !"
}