{
  "scroll_text.default": "Bienvenue sur Messenger ! Restez connecté avec vos amis et votre famille. Vous pouvez personnaliser le texte défilant via le fichier scroll-text.txt.",
  "app.title": "Messagerie",
  "chat.title": "Discussion",
  "chat.send": "Envoyer",
  "chat.placeholder": "Écrivez un message...",
  "notification.push_url_placeholder": "Entrez l'URL de notification push",
  "notification.save_button": "Enregistrer",
  "chat.quote_from": "Citation de {safeTimestamp}",
  "chat.quote_reply": "Répondre avec citation",
  "status.loading_messages": "Chargement des messages (page {page})...",
  "status.loaded_messages": "{count} messages chargés ({currentPage}/{totalPages})",
  "status.failed_load_history": "Échec du chargement de l'historique",
  "loading_indicator.text": "Chargement des messages...",
  "audio_player.not_supported": "Votre navigateur ne prend pas en charge la lecture audio.",
  "video_player.not_supported": "Votre navigateur ne prend pas en charge la lecture vidéo.",
  "file.download_title": "Télécharger le fichier : {fileName}",
  "notification.settings_title": "Paramètres des notifications",
  "sticker.modal_title": "Sélection de stickers",
  "version.info": "v6.1.0 | 25 août 2025",
  "version.update_title": "Mise à jour de la version",
  "version.update_content": "Nous sommes ravis d'annoncer l'ajout du mode sombre pour améliorer votre expérience de messagerie ! Maintenant, vous pouvez profiter de conversations confortables dans des environnements faiblement éclairés grâce à notre nouvelle fonctionnalité de mode sombre.\n\nLe mode sombre a été soigneusement conçu avec une feuille de style dédiée, dark.css, qui offre un contraste et une lisibilité améliorés dans toutes les parties de l'application. Que vous envoyiez des messages tard dans la nuit ou que vous préfériez une interface plus sombre, cette mise à jour garantit que vos yeux ne seront pas fatigués tout en restant en contact avec vos amis et votre famille.\n\nNotre équipe de développement a optimisé les couleurs de tous les éléments majeurs de l'interface utilisateur pour créer un thème sombre cohérent et visuellement attrayant. Les barres de défilement sont désormais plus faciles à voir et à utiliser, tandis que les fenêtres modales ressortent clairement sur le fond sombre. Les champs de saisie ont été ajustés pour une meilleure visibilité, vous permettant de taper vos messages sans aucun problème.\n\nLes messages eux-mêmes ont également reçu une attention particulière. Les couleurs du texte et les combinaisons de fonds ont été affinées pour vous assurer que vos conversations sont toujours faciles à lire. Cela signifie plus besoin de se scruter ou d'ajuster la luminosité de votre écran lorsqu'il fait sombre.\n\nPour activer le mode sombre, il vous suffit d'accéder aux paramètres de l'application et de rechercher l'option de mode sombre. Nous pensons que cette nouvelle fonctionnalité rendra votre temps passé sur Messenger encore plus agréable, quelle que soit la lumière ambiante. Essayez-la et faites-nous part de votre avis !",
  "version.got_it": "Compris !",
  "image_action.choose": "Choisir une action",
  "image_action.view": "Vue",
  "image_action.edit": "Éditer",
  "image_action.cancel": "Annuler",
  "image_editor.close": "Fermer",
  "image_editor.save_send": "Enregistrer et envoyer",
  "image_editor.edit_image": "Éditer l'image",
  "audio_upload.select_file": "Sélectionner un fichier audio",
  "audio_upload.browser_not_supported": "Votre navigateur ne prend pas en charge la capture audio. Veuillez sélectionner un fichier audio à partir de votre ordinateur.",
  "scroll_text.load_failed": "Échec du chargement du texte de défilement",
  "error.image_preview_failed": "Échec du chargement de la prévisualisation de l'image. Veuillez réessayer.",
  "error.image_editor_load_failed": "Échec du chargement de l'éditeur d'image. Veuillez réessayer.",
  "error.image_editor_open_failed": "Échec de l'ouverture de l'éditeur d'image: {errorMessage}",
  "error.save_image_failed": "Échec de l'enregistrement de l'image: {errorMessage}",
  "error.send_image_failed": "Échec de l'envoi de l'image. Veuillez réessayer.",
  "error.audio_upload_option_failed": "Échec de l'affichage des options d'upload audio. Veuillez réessayer."
}