{  "scroll_text.default": "Messengerへようこそ！友達や家族とのつながりを維持しましょう。scroll-text.txtファイルを使用してスクロールテキストをカスタマイズできます。",
  "chat.undo_message": "メッセージを撤回",
  "chat.message_undone": "このメッセージは撤回されました",
  "chat.confirm_undo": "このメッセージを撤回しますか？",
  "chat.undo_failed": "メッセージの撤回に失敗しました: {errorMessage}",
  "chat.message_undone_success": "メッセージが正常に撤回されました",
  "chat.offline": "オフライン状態です。メッセージを撤回できません",
  "app.title": "メッセンジャー",
  "chat.title": "チャット",
  "chat.send": "送信",
  "chat.placeholder": "メッセージを入力...",
  "notification.push_url_placeholder": "プッシュ通知URLを入力",
  "notification.save_button": "保存",
  "chat.quote_from": "引用元 {safeTimestamp}",
  "chat.quote_reply": "引用付き返信",
  "status.loading_messages": "メッセージを読み込んでいます (ページ {page})...",
  "status.loaded_messages": "{count} 件のメッセージを読み込みました ({currentPage}/{totalPages})",
  "status.failed_load_history": "履歴の読み込みに失敗しました",
  "loading_indicator.text": "メッセージを読み込んでいます...",
  "audio_player.not_supported": "あなたのブラウザはオーディオ再生をサポートしていません。",
  "video_player.not_supported": "あなたのブラウザはビデオ再生をサポートしていません。",
  "file.download_title": "ファイルをダウンロード: {fileName}",
  "notification.settings_title": "通知設定",
  "sticker.modal_title": "スタンプ選択",
  "version.info": "v7.0.0 | 2025年8月27日",
  "version.update_title": "バージョンアップデート",
  "version.update_content": "メッセージ撤回機能：デジタルコミュニケーションに人間性の寛容と的確な制御をもたらす\nデジタル通信が光速で進む時代において、私たちの指の一滑り、誤タップ、あるいは急いでしまった判断により、一瞬のうちに間違った、急ぎすぎた、または不完全なメッセージが送信され、誤解や恥ずかしさ、さらには深刻な結果を引き起こすことがあります。私たちは、完璧なコミュニケーションは理想的な状態であり、日常的なことではないことを理解しています。そこで、「メッセージ撤回」機能を盛大にリリースします。これは単なる技術的なアップデートではなく、深い人間性に配慮した取り組みであり、ユーザーのデジタルコミュニケーションに重要な安心感、制御感、余裕をもたらすことを目的としています。その核心的な価値は「取り消し」というアクションそのものを超え、信頼、専門性、心の安らぎに関わるものです。\nまず、この機能の最も直接的な価値は、**誤りの修正と修復、個人の専門的なイメージの維持**にあります。ハイペースな現代の仕事の中で、私たちはしばしば複数のチャットを同時に処理する必要があります。同僚Aに送る予定のメッセージを会社全体の大規模なチャットに誤送信したり、急いでいるあまり重要なデータやプロジェクトの日付を間違えたり、最終確認されていないファイルのバージョンを送信したりすることがあります。これらの些細なミスは、専門的な文脈では個人の信用やプロジェクトの進行に不釣り合いな損害を与える可能性があります。従来の対応方法は、「申し訳ありません、前のメッセージが間違っていました…」「こちらを正しいものとしてください…」「注意: 送り間違えました…」などの修正メッセージを連発することでした。この方法は効果が薄く、むしろ誤りを強調し、チャットの流れを混乱させ、送信者の不注意をさらに浮き彫りにします。メッセージ撤回機能はこの問題を優雅に解決します。重要な「黄金2分間」のウィンドウを提供し、ユーザーが迅速かつ目立たずにミスを取り消し、まるでそれが起こらなかったかのようにすることができます。これにより、コミュニケーションの厳密性と個人の専門的なイメージをきれいに維持することができます。ユーザーは単なる誤タップのために不要な説明コストを払う必要がなくなります。\n次に、この機能は**デジタルコミュニケーションにおける不安感を大幅に軽減し、コミュニケーションの自信と余裕を高める**効果があります。多くのユーザーは「送信後すぐに後悔する」（Post-Send Regret）不安な瞬間を経験しています。例えば、ちょうど送信した言葉遣いが無礼すぎて誤解を招きそうだと気づいたり、感情的になって不冷静な発言をして、落ち着いてから後悔したり、あるいは自動修正機能によって誠実な言葉が可笑しいミスマッチになってしまったことに突然気づいたりすることがあります。この不安感はメッセージが送信された瞬間に一気に湧き上がり、大きな心理的負担となります。メッセージ撤回機能は、あたかもすべてのユーザーにデジタルの「安全ネット」を装備したようなものです。これは軽率なコミュニケーションを助長するものではなく、むしろその存在自体が深い心理的な安心感をもたらします。ユーザーはミスを犯しても修正する機会があることを知り、この安心感がより自信を持って、よりリラックスしたコミュニケーションの心構えにつながります。彼らは表現の内容自体にもっと集中することができ、「絶対にミスをしてはいけない」という恐怖の中で生きる必要がなくなります。この心理的な負担の解放は、この機能がもたらす大きな潜在的な価値です。\nさらに、この機能は**チャットの明瞭性と有効性を最適化する**役割を果たします。前述のように、一連の新しいメッセージで古い誤りを修正すると、チャットのタイムラインが著しく汚染され、他の参加者が混乱し、どのメッセージが有効なのかを判断するために余計な労力を費やす必要があります。これは重要な意思決定の議論や情報が密集したプロジェクトのコミュニケーションにとって大きな妨げとなります。撤回機能は誤りの原因を取り除くことで、根本的にチャットの断片化を防ぎ、情報の流れをきれい、正確、効率的に保ちます。すべての参加者が見るのはより整然とした、正確なチャット履歴であり、これによりチームの協力と情報伝達の効率が直接向上します。\n最後に、そして最も重要なことは、この機能の設計には**コミュニケーションのすべての参加者に対する尊重と透明性が体現されている**ことです。私たちはメッセージを「見えなくなるように消す」選択をせず、それは疑念と不信を引き起こすからです。代わりに、メッセージが撤回された場合、システムはチャットに「あなたがメッセージを撤回しました」または「[ユーザー]がメッセージを撤回しました」という明確な通知を残します。この通知は非常に重要であり、チャットの文脈の完全性を維持し、すべての参加者に対して透明性を保ちます。これは送信者が誤りを修正する権利と、受信者がチャット履歴に変更があったことを知る権利とのバランスを取っています。この設計哲学の背後には、正直を基盤とした健全で透明なデジタル関係の提唱があります。これは、ここには修正された誤りがあったことをすべての人に伝える一方で、もはやその誤りに煩わされる必要がないことを示しています。\n要するに、メッセージ撤回機能の価値の核心は、「人間」を再び技術の上に置くことにあります。人間は不完美であることを認め、技術の目的はその不完美さを埋めることであり、それを無限に拡大することではないということです。この機能はただの2分間の時間枠を提供するだけでなく、貴重な贈り物を提供します。過ちを犯す余地、タイムリーに修正する機会、デジタル世界では希な余裕と安らぎです。ユーザーにこの的確な制御力を与えることで、私たちはより強力なソフトウェアを構築するだけでなく、より健全で自信に満ちた、効率的なコミュニケーション文化を育んでいます。この小さな一歩は、私たちの製品がより思いやりのある、人間性に配慮した未来へと着実に進むことを象徴しています。",
  "version.got_it": "了解！",
  "image_action.choose": "行動を選択",
  "image_action.view": "表示",
  "image_action.edit": "編集",
  "image_action.cancel": "キャンセル",
  "image_editor.close": "閉じる",
  "image_editor.save_send": "保存して送信",
  "image_editor.edit_image": "画像を編集",
  "audio_upload.select_file": "オーディオファイルを選択",
  "audio_upload.browser_not_supported": "使用中のブラウザは直接録音をサポートしていません。下記からオーディオファイルを選択してください。",
  "scroll_text.load_failed": "スクロールテキストの読み込みに失敗しました",
  "error.image_preview_failed": "画像のプレビューの読み込みに失敗しました。再試行してください。",
  "error.image_editor_load_failed": "画像エディタの読み込みに失敗しました。再試行してください。",
  "error.image_editor_open_failed": "画像エディタの開きに失敗しました: {errorMessage}",
  "error.save_image_failed": "画像の保存に失敗しました: {errorMessage}",
  "error.send_image_failed": "画像の送信に失敗しました。再試行してください。",
  "error.audio_upload_option_failed": "オーディオアップロードオプションの表示に失敗しました。再試行してください。",
  "socket.connected": "接続済み",
  "socket.disconnected": "切断済み",
  "socket.connection_error": "接続エラー: {errorMessage}",
  "message.send_error": "メッセージ送信エラー: {errorMessage}",
  "push_url.save_error": "プッシュURL保存エラー: {errorMessage}",
  "push_url.empty_url": "プッシュURLが入力されていません",
  "push_url.remove_error": "プッシュURL削除エラー: {errorMessage}",
  "pull_to_load.more": "↑ もっと見る",
  "file_upload.progress": "ファイルをアップロード中: {percent}%",
  "file_upload.uploaded": "ファイルのアップロードが完了しました",
  "upload.no_file_url": "アップロード失敗: サーバーからファイルURLが返されませんでした",
  "file_upload.button_title": "ファイルをアップロード",
  "upload.server_response_format_error": "アップロード失敗: サーバーの応答形式が正しくありません",
  "upload.failed": "アップロード失敗: {statusText}",
  "upload.network_error": "ネットワークエラー、アップロードに失敗しました",
  "sticker.load_failed": "スタンプの読み込みに失敗しました",
  "recording.in_progress": "録音中... クリックまたは離して終了",
  "recording.microphone_permission_failed": "マイクの許可を取得できませんでした、ブラウザの設定を確認してください",
  "recording.too_short": "録音時間が短すぎます、やり直してください",
  "audio_upload.progress": "音声メッセージをアップロード中: {percent}%",
  "audio_upload.sent": "音声メッセージを送信しました ({duration}秒)",
  "chat.sticker": "スタンプを送信",
  "chat.upload": "ファイルをアップロード",
  "chat.record_audio": "音声を録音"
}