{
  "scroll_text.default": "Selamat datang ke Messenger! Terus terhubung dengan rakan dan keluarga anda. Anda boleh menyesuaikan teks berulang dengan menggunakan fail scroll-text.txt.",
  "app.title": "Pengirim Pesan",
  "chat.title": "Sembang", 
  "chat.send": "Hantar",
  "chat.placeholder": "Taip mesej...",
  "notification.push_url_placeholder": "Masukkan URL pemberitahuan push",
  "notification.save_button": "Simpan",
  "chat.quote_from": "Cita dari {safeTimestamp}",
  "chat.quote_reply": "Balas dengan petikan",
  "status.loading_messages": "Memuat mesej (halaman {page})...",
  "status.loaded_messages": "Memuatkan {count} mesej ({currentPage}/{totalPages})",
  "status.failed_load_history": "Gagal memuat sejarah",
  "loading_indicator.text": "Memuat mesej...",
  "audio_player.not_supported": "Pelayar anda tidak menyokong main semula audio.",
  "video_player.not_supported": "Pelayar anda tidak menyokong main semula video.",
  "file.download_title": "Muat turun fail: {fileName}",
  "notification.settings_title": "Tetapan Pemberitahuan",
  "sticker.modal_title": "Pilihan Stiker",
  "version.info": "v6.0.0 | 25 Ogos 2025",
  "version.update_title": "Kemas Kini Versi",
  "version.update_content": "Kami bersemangat untuk mengumumkan penambahan mod gelap untuk meningkatkan pengalaman menghantar mesej anda! Sekarang, anda boleh menikmati perbualan dengan selesa dalam persekitaran cahaya rendah dengan ciri mod gelap baharu kami.\n\nMod gelap telah direka dengan teliti menggunakan lembaran gaya khusus, dark.css, yang meningkatkan kontras dan kebolehbacaan setiap bahagian dalam aplikasi. Sama ada anda menghantar mesej lewat malam atau hanya lebih suka antara muka yang lebih gelap, kemas kini ini memastikan mata anda tidak akan tertekan semasa anda tetap berhubung dengan rakan dan keluarga.\n\nPasukan pembangunan kami telah mengoptimumkan warna semua elemen UI utama untuk mencipta tema gelap yang bersatu padu dan menarik dari segi visual. Garis luncur kini lebih mudah dilihat dan digunakan, manakala modal terlihat jelas di atas latar belakang gelap. Medan input telah disesuaikan untuk meningkatkan kebolehlihatan, jadi anda boleh menaip mesej anda tanpa sebarang masalah.\n\nMesej sendiri juga telah menerima perhatian khusus. Warna teks dan kombinasi latar belakang telah diatur secara teliti untuk memastikan perbualan anda sentiasa mudah dibaca. Ini bermakna tiada lagi memipitkan mata atau menyesuaikan kecerahan skrin apabila anda berada di dalam bilik yang gelap.\n\nUntuk bertukar kepada mod gelap, cukup navigasikan ke tetapan aplikasi dan cari pilihan mod gelap. Kami percaya ciri baharu ini akan menjadikan masa anda di Messenger lebih menyeronokkan, tanpa mengira keadaan pencahayaan. Cuba sekarang dan beritahu kami pendapat anda!",
  "version.got_it": "Faham!",
  "image_action.choose": "Pilih Aksi",
  "image_action.view": "Lihat",
  "image_action.edit": "Edit",
  "image_action.cancel": "Batal",
  "image_editor.close": "Tutup",
  "image_editor.save_send": "Simpan dan Hantar",
  "image_editor.edit_image": "Edit Gambar"
}