{
  "scroll_text.default": "Selamat datang ke Messenger! Terus terhubung dengan rakan dan keluarga anda. Anda boleh menyesuaikan teks berulang dengan menggunakan fail scroll-text.txt.",
  "app.title": "Pengirim Pesan",
  "chat.title": "Sembang", 
  "chat.send": "Hantar",
  "chat.placeholder": "Taip mesej...",
  "notification.push_url_placeholder": "Masukkan URL pemberitahuan push",
  "notification.save_button": "Simpan",
  "chat.quote_from": "Cita dari {safeTimestamp}",
  "chat.quote_reply": "Balas dengan petikan",
  "status.loading_messages": "Memuat mesej (halaman {page})...",
  "status.loaded_messages": "Memuatkan {count} mesej ({currentPage}/{totalPages})",
  "status.failed_load_history": "Gagal memuat sejarah",
  "loading_indicator.text": "Memuat mesej...",
  "audio_player.not_supported": "Pelayar anda tidak menyokong main semula audio.",
  "video_player.not_supported": "Pelayar anda tidak menyokong main semula video.",
  "file.download_title": "Muat turun fail: {fileName}",
  "notification.settings_title": "Tetapan Pemberitahuan",
  "sticker.modal_title": "Pilihan Stiker",
  "version.info": "v5.1.0 | 24 Ogos 2025",
  "version.update_title": "Kemas Kini Versi 5.0",
  "version.update_content": "Kemas kini kali ini telah mengoptimumkan sepenuhnya prestasi sistem dan interaksi antaramuka, seterusnya meningkatkan pengalaman pengguna anda. Kami telah membuat pelbagai penyesuaian terperinci kepada pelbagai aliran operasi, dengan tindak balas yang lebih cepat dan lebih semula jadi. Kami berharap setiap klik anda akan memberikan pengalaman yang lancar dan selesa.\nSementara itu, versi baharu ini telah memperluas sokongan untuk muat naik dan pratinjau pelbagai format fail. Sama ada itu dokumen, imej atau fail padat, anda kini boleh melihat dan menguruskan mereka secara dalam talian dengan lebih mudah, dan tidak perlu lagi risau tentang keserasian format.\nSeperti biasa, kami menumpukan perhatian kepada setiap perbaikan butiran untuk memberikan anda alat yang lebih mudah digunakan dan lebih boleh dipercayai. Terima kasih kerana sokongan anda sepanjang ini. Kami akan terus berusaha keras untuk membawa lebih banyak fungsi berguna!",
  "version.got_it": "Faham!"
}